In [2]:
import numpy as np
import pandas as pd

In [3]:
data = pd.read_csv('./bank-additional.csv',sep=',""')
data

/var/folders/db/q45d2_5d0c52zkvrdw9tp0xm0000gn/T/ipykernel_4419/2435851106.py:1: ParserWarning: Falling back to the 'python' engine because the 'c' engine does not support regex separators (separators > 1 char and different from '\s+' are interpreted as regex); you can avoid this warning by specifying engine='python'.
  data = pd.read_csv('./bank-additional.csv',sep=',""')

,"""age","job""""","marital""""","education""""","default""""","housing""""","loan""""","contact""""","month""""","day_of_week""""",...,"campaign""""","pdays""""","previous""""","poutcome""""","emp.var.rate""""","cons.price.idx""""","cons.conf.idx""""","euribor3m""""","nr.employed""""","y"""""""
0,"""30","blue-collar""""","married""""","basic.9y""""","no""""","yes""""","no""""","cellular""""","may""""","fri"""",487,2,999,0",...,"no""""""",NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,"""39","services""""","single""""","high.school""""","no""""","no""""","no""""","telephone""""","may""""","fri"""",346,4,999,0",...,"no""""""",NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,"""25","services""""","married""""","high.school""""","no""""","yes""""","no""""","telephone""""","jun""""","wed"""",227,1,999,0",...,"no""""""",NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,"""38","services""""","married""""","basic.9y""""","no""""","unknown""""","unknown""""","telephone""""","jun""""","fri"""",17,3,999,0",...,"no""""""",NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,"""47","admin.""""","married""""","university.degree""""","no""""","yes""""","no""""","cellular""""","nov""""","mon"""",58,1,999,0",...,"no""""""",NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
4114,"""30","admin.""""","married""""","basic.6y""""","no""""","yes""""","yes""""","cellular""""","jul""""","thu"""",53,1,999,0",...,"no""""""",NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4115,"""39","admin.""""","married""""","high.school""""","no""""","yes""""","no""""","telephone""""","jul""""","fri"""",219,1,999,0",...,"no""""""",NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4116,"""27","student""""","single""""","high.school""""","no""""","no""""","no""""","cellular""""","may""""","mon"""",64,2,999,1",...,"no""""""",NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4117,"""58","admin.""""","married""""","high.school""""","no""""","no""""","no""""","cellular""""","aug""""","fri"""",528,1,999,0",...,"no""""""",NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4118,"""34","management""""","single""""","high.school""""","no""""","yes""""","no""""","cellular""""","nov""""","wed"""",175,1,999,0",...,"no""""""",NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [4]:
data[data.columns] = data[data.columns].replace({'"':''}, regex=True)
data

,"""age","job""""","marital""""","education""""","default""""","housing""""","loan""""","contact""""","month""""","day_of_week""""",...,"campaign""""","pdays""""","previous""""","poutcome""""","emp.var.rate""""","cons.price.idx""""","cons.conf.idx""""","euribor3m""""","nr.employed""""","y"""""""
0,30,blue-collar,married,basic.9y,no,yes,no,cellular,may,"fri,487,2,999,0",...,no,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,39,services,single,high.school,no,no,no,telephone,may,"fri,346,4,999,0",...,no,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,25,services,married,high.school,no,yes,no,telephone,jun,"wed,227,1,999,0",...,no,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,38,services,married,basic.9y,no,unknown,unknown,telephone,jun,"fri,17,3,999,0",...,no,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,47,admin.,married,university.degree,no,yes,no,cellular,nov,"mon,58,1,999,0",...,no,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
4114,30,admin.,married,basic.6y,no,yes,yes,cellular,jul,"thu,53,1,999,0",...,no,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4115,39,admin.,married,high.school,no,yes,no,telephone,jul,"fri,219,1,999,0",...,no,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4116,27,student,single,high.school,no,no,no,cellular,may,"mon,64,2,999,1",...,no,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4117,58,admin.,married,high.school,no,no,no,cellular,aug,"fri,528,1,999,0",...,no,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4118,34,management,single,high.school,no,yes,no,cellular,nov,"wed,175,1,999,0",...,no,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [5]:
data.columns = data.columns.str.replace('"','')
data

,age,job,marital,education,default,housing,loan,contact,month,day_of_week,...,campaign,pdays,previous,poutcome,emp.var.rate,cons.price.idx,cons.conf.idx,euribor3m,nr.employed,y
0,30,blue-collar,married,basic.9y,no,yes,no,cellular,may,"fri,487,2,999,0",...,no,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,39,services,single,high.school,no,no,no,telephone,may,"fri,346,4,999,0",...,no,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,25,services,married,high.school,no,yes,no,telephone,jun,"wed,227,1,999,0",...,no,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,38,services,married,basic.9y,no,unknown,unknown,telephone,jun,"fri,17,3,999,0",...,no,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,47,admin.,married,university.degree,no,yes,no,cellular,nov,"mon,58,1,999,0",...,no,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
4114,30,admin.,married,basic.6y,no,yes,yes,cellular,jul,"thu,53,1,999,0",...,no,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4115,39,admin.,married,high.school,no,yes,no,telephone,jul,"fri,219,1,999,0",...,no,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4116,27,student,single,high.school,no,no,no,cellular,may,"mon,64,2,999,1",...,no,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4117,58,admin.,married,high.school,no,no,no,cellular,aug,"fri,528,1,999,0",...,no,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4118,34,management,single,high.school,no,yes,no,cellular,nov,"wed,175,1,999,0",...,no,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [6]:
attribute = data.loc[:, data.columns.intersection(['age','job','marital','education','housing','loan'])]
numericalAttribute = attribute
attribute

     age          job  marital          education  housing     loan
0     30  blue-collar  married           basic.9y      yes       no
1     39     services   single        high.school       no       no
2     25     services  married        high.school      yes       no
3     38     services  married           basic.9y  unknown  unknown
4     47       admin.  married  university.degree      yes       no
...   ..          ...      ...                ...      ...      ...
4114  30       admin.  married           basic.6y      yes      yes
4115  39       admin.  married        high.school      yes       no
4116  27      student   single        high.school       no       no
4117  58       admin.  married        high.school       no       no
4118  34   management   single        high.school      yes       no

[4119 rows x 6 columns]

In [15]:
age_groups = [18, 25, 29, 34, 39, 44, 49, 56, 60,70,88]
age_group_names = ['18-25', '26-29', '30-34', '35-39', '40-44', '45-49', '50-56', '57-60','61-70','71-88']

ageGroup = pd.cut(
    attribute['age'], bins=age_groups,labels=age_group_names,right=False
)
ageGroup.head()
frquency = ageGroup.value_counts(normalize=False)
percentage = ageGroup.value_counts(normalize=True)
percentage *= 100

In [16]:
data2 = {'frequency':frquency,
        'percentage': round(percentage,2)}


ages = pd.DataFrame(data2)
ages['percentage'] = ages['percentage'].astype(str)+'%'
ages = ages.sort_index(axis= 0,kind='quicksort')
ages.to_csv('./attributes/ages.csv')
ages

       frequency percentage
18-25         98      2.38%
26-29        314      7.63%
30-34        893     21.69%
35-39        801     19.45%
40-44        603     14.64%
45-49        493     11.97%
50-56        558     13.55%
57-60        249      6.05%
61-70         71      1.72%
71-88         38      0.92%

In [17]:
frquency = attribute.job.value_counts(normalize=False)
percentage = attribute.job.value_counts(normalize=True)
percentage *= 100
data2 = {'frequency':frquency,
        'percentage': round(percentage,2)}

job = pd.DataFrame(data2)
job['percentage'] = job['percentage'].astype(str)+'%'
job = job.sort_values(job.columns[1],kind='quicksort')
job.to_csv('./attributes/job.csv')
job

               frequency percentage
unknown               39      0.95%
student               82      1.99%
technician           691     16.78%
housemaid            110      2.67%
unemployed           111      2.69%
blue-collar          884     21.46%
admin.              1012     24.57%
entrepreneur         148      3.59%
self-employed        159      3.86%
retired              166      4.03%
management           324      7.87%
services             393      9.54%

In [18]:
frequency = attribute.education.value_counts(normalize=False)
percentage = attribute.education.value_counts(normalize=True)
percentage *=100
data2 = {'frequency':frequency,
        'percentage': round(percentage,2)}

education = pd.DataFrame(data2)
education['percentage'] = education['percentage'].astype(str)+'%'
education = education.sort_values(education.columns[1],kind='quicksort')
education.to_csv('./attributes/education.csv')
education

                     frequency percentage
illiterate                   1      0.02%
basic.4y                   429     10.42%
professional.course        535     12.99%
basic.9y                   574     13.94%
high.school                921     22.36%
university.degree         1264     30.69%
unknown                    167      4.05%
basic.6y                   228      5.54%

In [19]:
frequency = attribute.loan.value_counts(normalize=False)
percentage = attribute.loan.value_counts(normalize=True)
percentage *= 100
data2 = {'frequency':frequency,
        'percentage': round(percentage,2)}

loan = pd.DataFrame(data2)
loan['percentage'] = loan['percentage'].astype(str)+'%'
loan = loan.sort_values(loan.columns[1],kind='quicksort')
loan.to_csv('./attributes/loan.csv')
loan

         frequency percentage
yes            665     16.14%
unknown        105      2.55%
no            3349     81.31%

In [20]:
frequency = attribute.marital.value_counts(normalize=False)
percentage = attribute.marital.value_counts(normalize=True)
percentage *=100
data2 = {'frequency':frequency,
        'percentage': round(percentage,2)}

marital = pd.DataFrame(data2)
marital['percentage'] = marital['percentage'].astype(str)+'%'
marital = marital.sort_values(marital.columns[1],kind='quicksort')
marital.to_csv('./attributes/marital.csv')
marital

          frequency percentage
unknown          11      0.27%
divorced        446     10.83%
single         1153     27.99%
married        2509     60.91%

In [21]:
frequency = attribute.housing.value_counts(normalize=False)
percentage = attribute.housing.value_counts(normalize=True)
percentage *=100
data2 = {'frequency':frequency,
        'percentage': round(percentage,2)}

housing = pd.DataFrame(data2)
housing['percentage'] = housing['percentage'].astype(str)+'%'
housing = housing.sort_values(housing.columns[1],kind='quicksort')
housing.to_csv('./attributes/housing.csv')
housing

         frequency percentage
unknown        105      2.55%
no            1839     44.65%
yes           2175      52.8%

CHANGE TO NUMERICAL

In [22]:
numericalAttribute['education'] = attribute['education'].replace({'university.degree': 100,'professional.course':92,'high.school':85,'basic.9y':78,'basic.6y':71,'basic.4y':64,'illiterate':57,'unknown':50 })
numericalAttribute['marital'] = attribute['marital'].replace({'married':100,'single':80,'divorced':70,'unknown':50})
numericalAttribute['job'] = attribute['job'].replace({'entrepreneur':100,'self-employed':95,'management':90,'admin.':85,'retired':80,'technician':75,'services':70,'blue-collar':65,'housemaid':60,'student':55,'unemployed':52,'unknown':50})
numericalAttribute['housing'] = attribute['housing'].replace({'yes':100,'no':55,'unknown':50})
numericalAttribute['loan'] = attribute['loan'].replace({'no':100,'yes':55,'unknown':50})

In [23]:
attribute['age'] = pd.to_numeric(attribute['age'])

In [24]:
rank1=attribute['age'].between(30,34).values
numericalAttribute.loc[rank1, 'age']=100
rank2 = attribute['age'].between(35,39).values
numericalAttribute.loc[rank2,'age'] = 95
rank3 = attribute['age'].between(40,44).values
numericalAttribute.loc[rank3,'age'] = 90
rank4 = attribute['age'].between(45,49).values
numericalAttribute.loc[rank4,'age'] = 85
rank5 = attribute['age'].between(50,56).values
numericalAttribute.loc[rank5,'age'] = 80
rank6 = attribute['age'].between(26,29).values
numericalAttribute.loc[rank6,'age'] = 70
rank7 = attribute['age'].between(18,25).values
numericalAttribute.loc[rank7,'age'] = 65
rank8  =attribute['age'].between(57,60).values
numericalAttribute.loc[rank8,'age'] = 60
rank9 = attribute['age'].between(61,70).values
numericalAttribute.loc[rank9,'age'] = 55
rank10 = attribute['age'].between(71,88).values
numericalAttribute.loc[rank10,'age'] = 50

In [25]:
numericalAttribute

      age  job  marital  education  housing  loan
0     100   65      100         78      100   100
1      95   70       80         85       55   100
2      55   70      100         85      100   100
3      95   70      100         78       50    50
4      50   85      100        100      100   100
...   ...  ...      ...        ...      ...   ...
4114  100   85      100         71      100    55
4115   95   85      100         85      100   100
4116   55   55       80         85       55   100
4117   60   85      100         85       55   100
4118  100   90       80         85      100   100

[4119 rows x 6 columns]

In [26]:
numericalAttribute.to_csv('./numericalAttribute.csv')

Data Corellation

Profile = weight* (age) + weight *(marital) + weight*(education )
weight = 1

activity = job

loanrisk = weight * (housing) + weight* (loan)

In [3]:
result = pd.read_csv('./numericalAttribute.csv')
result.drop(columns=result.columns[0],axis=1, inplace=True)

In [4]:
result

      age  job  marital  education  housing  loan
0     100   65      100         78      100   100
1      95   70       80         85       55   100
2      55   70      100         85      100   100
3      95   70      100         78       50    50
4      50   85      100        100      100   100
...   ...  ...      ...        ...      ...   ...
4114  100   85      100         71      100    55
4115   95   85      100         85      100   100
4116   55   55       80         85       55   100
4117   60   85      100         85       55   100
4118  100   90       80         85      100   100

[4119 rows x 6 columns]

In [29]:
profile = (result.age * 0.25) +(result.marital * 0.2) + (result.education * 0.45)
activity  = result.job
loanRisk = (result.housing * 0.75) + (result.loan * 0.25)

In [51]:
data2 = {'profile':round(profile).astype(int),
        'activity':activity,
        'loanRisk':round(loanRisk).astype(int),
        'recommendation':0,
        'Trust Score':0,
        }
# Create the pandas DataFrame
finalData = pd.DataFrame(data2)

In [52]:
finalData

      profile  activity  loanRisk  recommendation  Trust Score
0          80        65       100               0            0
1          78        70        66               0            0
2          72        70       100               0            0
3          79        70        50               0            0
4          78        85       100               0            0
...       ...       ...       ...             ...          ...
4114       77        85        89               0            0
4115       82        85       100               0            0
4116       68        55        66               0            0
4117       73        85        66               0            0
4118       79        90       100               0            0

[4119 rows x 5 columns]

In [50]:
finalData.to_csv('./finalData/FinalData.csv',index = False)

In [26]:
result = pd.read_csv('./finalData/FinalData.csv')
result.drop(columns=result.columns[4],axis=1, inplace=True)
result.drop(columns=result.columns[3],axis=1, inplace=True)

In [27]:
result

      profile  activity  loanRisk
0          80        65       100
1          78        70        66
2          72        70       100
3          79        70        50
4          78        85       100
...       ...       ...       ...
4114       77        85        89
4115       82        85       100
4116       68        55        66
4117       73        85        66
4118       79        90       100

[4119 rows x 3 columns]

In [28]:
size = 10
list_of_dfs = [result.loc[i:i+size-1,:] for i in range(0, len(result),size)]

In [36]:
index = 0
batchData = list_of_dfs[index]
batch = pd.DataFrame(batchData)

In [41]:
batchT = batch.T
batchT

            0   1    2   3    4   5    6    7   8   9
profile    80  78   72  79   78  86   86   88  80  79
activity   65  70   70  70   85  70   85  100  70  65
loanRisk  100  66  100  50  100  66  100  100  66  66

In [ ]:
batchT.to_csv('./batch1Pivot.csv',index = True,header=False)